Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortWarn Property
 AdjustEdge is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AdjustEdgeTooShortWarn { get; }
Public Shared ReadOnly Property AdjustEdgeTooShortWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AdjustEdgeTooShortWarn {
	FailureDefinitionId^ get ();
}
static member AdjustEdgeTooShortWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace